In [2]:
import pandas as pd 

#read csv file into dataframe
df=pd.read_csv('clt.csv')
print(df)

      Name  Age      Place Salary  Empty Column
0  Kingini   20     Kannur  45000           NaN
1    Tuttu   23    Calicut  35000           NaN
2   Chinnu   23  Kolathara  35000           NaN
3    Dhamu   23    Calicut  40000           NaN
4     Ikka   24    Poonoor  60000           NaN
5     Angu   24    Palazhi  30000           NaN
6  Kuttapi   23  Chevayoor  45000           NaN
7      Nan  Nan        Nan    Nan           NaN

In [41]:
#removing particular row without empty data
df_cleaned_row = df.dropna(axis=0,how="all")
print(df_cleaned_row)

      Name  Age      Place Salary  Empty Column
0  Kingini   20     Kannur  45000           NaN
1    Tuttu   23    Calicut  35000           NaN
2   Chinnu   23  Kolathara  35000           NaN
3    Dhamu   23    Calicut  40000           NaN
4     Ikka   24    Poonoor  60000           NaN
5     Angu   24    Palazhi  30000           NaN
6  Kuttapi   23  Chevayoor  45000           NaN
7      Nan  Nan        Nan    Nan           NaN

In [21]:
#removing particular column without empty data
df_cleaned_col = df.dropna(axis=1,how="all")
print(df_cleaned_col)

      Name  Age      Place Salary
0  Kingini   20     Kannur  45000
1    Tuttu   23    Calicut  35000
2   Chinnu   23  Kolathara  35000
3    Dhamu   23    Calicut  40000
4     Ikka   24    Poonoor  60000
5     Angu   24    Palazhi  30000
6  Kuttapi   23  Chevayoor  45000
7      Nan  Nan        Nan    Nan

In [43]:
df_filled_data = df.fillna(0)
print(df_filled_data)

      Name  Age      Place Salary  Empty Column
0  Kingini   20     Kannur  45000           0.0
1    Tuttu   23    Calicut  35000           0.0
2   Chinnu   23  Kolathara  35000           0.0
3    Dhamu   23    Calicut  40000           0.0
4     Ikka   24    Poonoor  60000           0.0
5     Angu   24    Palazhi  30000           0.0
6  Kuttapi   23  Chevayoor  45000           0.0
7      Nan  Nan        Nan    Nan           0.0